Revit 2027 API
BuiltInFailures.SiteImportFailures.TooFewPoints Property
 The toposolid must have at least three distinct points
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooFewPoints { get; }
Public Shared ReadOnly Property TooFewPoints As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooFewPoints {
	FailureDefinitionId^ get ();
}
static member TooFewPoints : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace